// +----------------------------------------------------------------------
// | Name 云纹框架
// +----------------------------------------------------------------------
// | Author 唐启云 <tqy@fxri.net>
// +----------------------------------------------------------------------
// | Copyright Copyright © 2017-2099 方弦研究所. All rights reserved.
// +----------------------------------------------------------------------
// | Link https://www.fxri.net
// +----------------------------------------------------------------------

/**
 * 云纹物料-元素-隐藏字段-皮肤
 */
fxView['machine']['deployer'](['material', 'elem', 'hidden', 'skin', 'deploy'], {
  // 搜索,视图
  'search,view': function (dark, base, echo, tray) {
    // 初始化变量
    base['pack'].append(dark['elem'])
  },
})
